papaj-23/MPU-6050-driver-for-stm32/mpu-6050.h
#ifndef MPU_6050_H
#define MPU_6050_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32l4xx_hal.h"

typedef enum {
    MPU_SINGLE_MODE = 0U,
    MPU_BURST_MODE = 1U,
    MPU_LOWPOWER_CYCLE_MODE = 2U,
} MPU_6050_mode_t;

typedef enum {
    MPU_BUS_UNLOCKED = 0U,
    MPU_BUS_LOCKED = 1U
} MPU_6050_bus_access_t;

typedef struct {
    I2C_HandleTypeDef *hi2c;
    MPU_6050_mode_t meas_mode;
    MPU_6050_bus_access_t bus_status;
    void (*delay_ms_wrapper)(uint32_t);
    uint16_t burst_count;
    volatile uint16_t fifo_count;
    volatile uint8_t fifo_count_raw[2];
    volatile uint8_t int_status;
    uint8_t *tx_buffer;
    uint8_t *rx_buffer;  
    uint8_t gyro_scale;
    uint8_t accel_scale;
    volatile uint8_t fifo_oflow_flag;
    struct {
        uint8_t acc_x :1;
        uint8_t acc_y :1;
        uint8_t acc_z :1;
        uint8_t temp :1;
        uint8_t gyro_x :1;
        uint8_t gyro_y :1;
        uint8_t gyro_z :1;
        uint8_t reserved :1;
    } active_sources;
} MPU_6050_t;

typedef struct {
    float accel_x;
    float accel_y;
    float accel_z;
    float gyro_x;
    float gyro_y;
    float gyro_z;
} MPU_6050_selftest_t;

typedef struct {
    float accel_x;
    float accel_y;
    float accel_z;
    float temp;
    float gyro_x;
    float gyro_y;
    float gyro_z;
} MPU_6050_data_t;

typedef enum {
    DPS_250 = 0U,
    DPS_500 = 1U,
    DPS_1000 = 2U,
    DPS_2000 = 3U
} MPU_6050_gyro_range_t;

typedef enum {
    G_2 = 0U,
    G_4 = 1U,
    G_8 = 2U,
    G_16 = 3U
} MPU_6050_accel_range_t;

typedef enum {
    FIFO_ACCEL = 8U,
    FIFO_GYRO_Z = 16U,
    FIFO_GYRO_Y = 32U,
    FIFO_GYRO_X = 64U,
    FIFO_TEMP = 128U
} MPU_6050_fifo_content_t;

typedef enum {
    MPU_DISABLE = 0U,
    MPU_ENABLE = 1U
} MPU_6050_state_t;

typedef enum {
    F_1_25HZ = 0U,
    F_5HZ = 1U,
    F_20HZ = 2U,
    F_40HZ = 3U
} MPU_6050_lp_freq_t;

typedef enum {
    ACCEL_X_CH = 0U,
    ACCEL_Y_CH = 1U,
    ACCEL_Z_CH = 2U,
    TEMP_CH = 3U,
    GYRO_X_CH = 4U,
    GYRO_Y_CH = 5U,
    GYRO_Z_CH = 6U
} MPU_6050_meas_channel_t;


#define I2C_ADDRESS_7B      (uint16_t) 0x68U //0x69 is the other available address for MPU6050

#define BURST_COUNT 600

/* Sample Rate = GyroRate / (1 + SMPLRT_DIV)
 * GyroRate = 1kHz (DLPF on) or 8kHz (DLPF off) */
#define SMPLTR_DIV_VAL_DEFAULT      0x09U

/* For details check out README section DPLF Setting or vendor datasheet directly */
#define CONFIG_VAL_DEFAULT          0x04U

#define MPU_USE_DEBUG_REGISTERS 0


#if (MPU_USE_DEBUG_REGISTERS == 1)
  /**
    * @brief  Read all register values.
    * @param  handles Pointer to MPU6050 handle structure.
    * @param  values List to store register values
    * 
    * @details Read all values of registers used in this library except of FIFO_R_W.
    * 
    * @note This function is for debug purpose, it has to be enabled by setting MPU_USE_DEBUG_REGISTERS to 1
    * 
    * @retval HAL status.
    */
  HAL_StatusTypeDef MPU_6050_check_registers(MPU_6050_t *handles);
#endif

/**
  * @brief  Initialize MPU6050 sensor with default configuration.
  * @param  handles Pointer to MPU6050 handle structure.
  *
  * @details
  * Writes a set of default register values (power management, sample rate divider,
  * low-pass filter config, FIFO enable, interrupt enable) included in init_registers[].
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_init(MPU_6050_t *handles);

/**
  * @brief  Configure MPU6050 power/streaming mode (single sample, FIFO burst, or low-power cycle).
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  mode    Selected mode: MPU_SINGLE_MODE, MPU_BURST_MODE, or MPU_LOWPOWER_CYCLE_MODE.
  *
  * @details
  * The function configures interrupt source, FIFO usage and power-management bits
  * to match the selected operating mode:
  *
  * MPU_SINGLE_MODE:
  *  - Enables Data Ready interrupt (INT_ENABLE: DATA_RDY_EN).
  *  - Disables FIFO streaming (USER_CTRL: FIFO_EN = 0).
  *  - Forces normal operation: CYCLE = 0, SLEEP = 0.
  *  - Enables temperature sensor and all accel/gyro axes (standby bits cleared).
  *
  * MPU_BURST_MODE:
  *  - Enables FIFO Overflow interrupt (INT_ENABLE: FIFO_OFLOW_EN).
  *  - Enables FIFO streaming (USER_CTRL: FIFO_EN = 1).
  *  - Forces normal operation: CYCLE = 0, SLEEP = 0.
  *  - Enables temperature sensor and all accel/gyro axes (standby bits cleared).
  *
  * MPU_LOWPOWER_CYCLE_MODE:
  *  - Enables Data Ready interrupt (INT_ENABLE: DATA_RDY_EN).
  *  - Disables FIFO streaming (USER_CTRL: FIFO_EN = 0).
  *  - Configures accel-only low power cycling:
  *      * TEMP disabled (PWR_MGMT_1: TEMP_DIS = 1)
  *      * Gyro placed in standby (PWR_MGMT_2: gyro standby bits = 1)
  *      * Accel enabled (PWR_MGMT_2: accel standby bits = 0)
  *      * CYCLE enabled, SLEEP disabled (PWR_MGMT_1: CYCLE = 1, SLEEP = 0)
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_set_mode(MPU_6050_t *handles, MPU_6050_mode_t mode);

/**
  * @brief  Turn on/off Sleep Mode
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  state MPU_ENABLE to enable, MPU_DISABLE to disable.
  * 
  * @details In sleep mode all onboard sensor and internal clock source are turned off.
  * This mode can be used in low power applications.
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_set_sleep(MPU_6050_t *handles, MPU_6050_state_t state);

/**
  * @brief  Configure wake-up frequency for accelerometer low-power cycle mode.
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  freq    Low-power wake-up frequency selection (MPU_6050_lp_freq_t).
  *
  * @details
  * Updates LP_WAKE_CTRL[7:6] bits in the PWR_MGMT_2 register.
  * These bits define the internal wake-up rate used in
  * MPU_LOWPOWER_CYCLE_MODE (accelerometer-only duty-cycled operation).
  *
  * The function performs a read-modify-write operation to preserve
  * unrelated configuration bits in PWR_MGMT_2.
  *
  * @note
  * This setting has effect only when CYCLE mode is enabled
  * (PWR_MGMT_1: CYCLE = 1). In normal continuous measurement
  * modes, this field does not affect sensor output rate.
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_set_lp_wakeup_freq(MPU_6050_t *handles, MPU_6050_lp_freq_t freq);

/**
  * @brief  Enable or disable selected measurement source.
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  ch      Measurement channel to configure (accelerometer axis,
  *                 gyroscope axis or temperature).
  * @param  state   MPU_ENABLE to enable, MPU_DISABLE to disable.
  *
  * @details
  * The function controls measurement sources by modifying standby bits
  * in power management registers.
  *
  * For accelerometer and gyroscope axes, the corresponding standby bits
  * in PWR_MGMT_2 register are modified. Setting a standby bit disables the
  * axis, clearing it enables measurement.
  *
  * For temperature sensor, TEMP_DIS bit in PWR_MGMT_1 register is modified.
  * Setting TEMP_DIS disables temperature measurement, clearing it enables it.
  *
  * FIFO content is updated automatically for the affected channel:
  * - Gyroscope axes and temperature sensor directly enable/disable their
  *   corresponding FIFO sources.
  * - Accelerometer FIFO entry is shared between X/Y/Z axes, therefore it is
  *   enabled when at least one accelerometer axis is active and disabled only
  *   when all accelerometer axes are turned off.
  *
  * FIFO configuration may also be controlled independently using
  * MPU_6050_Set_FIFO_Content() if manual configuration is required.
  *
  * @attention Internal logic is inverted relative to the register bits:
  *            passing MPU_ENABLE enables the selected measurement channel,
  *            while MPU_DISABLE disables it.
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_set_source(MPU_6050_t *handles, MPU_6050_meas_channel_t ch, MPU_6050_state_t state);

/**
  * @brief  Reset MPU6050 FIFO buffer and re-enable FIFO operation.
  * @param  handles Pointer to MPU6050 handle structure.
  *
  * @details
  * Clears FIFO enable bit, triggers FIFO reset bit, then re-enables FIFO.
  * If handles->delay_ms_wrapper is provided, it may be used to wait a short time
  * between reset and re-enable.
  * 
  * @attention function is to be used when FIFO_OVERFLOW interrupt occurs
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_fifo_reset(MPU_6050_t *handles);

/**
  * @brief  Perform built-in self-test procedure of MPU6050.
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  result  Pointer to structure storing self-test results (in %).
  *
  * @details
  * The device should remain stationary during the test. The function:
  *  - Saves current PWR_MGMT1 and PWR_MGMT2.
  *  - Saves current GYRO_CONFIG and ACCEL_CONFIG.
  *  - Applies test ranges and reads self-test factory trim codes.
  *  - Reads sensor outputs with self-test disabled and enabled.
  *  - Restores original configuration.
  *  - Computes self-test response ratio in percent.
  *
  * A delay callback (handles->delay_ms_wrapper) may be required for stable results.
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_self_test(MPU_6050_t *handles, MPU_6050_selftest_t *result);

/**
  * @brief  Set gyroscope full-scale range.
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  range   Gyroscope range selection (DPS_250, DPS_500, DPS_1000, DPS_2000).
  *
  * @details
  * Updates FS_SEL bits in GYRO_CONFIG register. Afterwards, the gyro signal path
  * reset is triggered to ensure internal filtering state is refreshed.
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_set_gyro_range(MPU_6050_t *handles, MPU_6050_gyro_range_t range);

/**
  * @brief  Set accelerometer full-scale range.
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  range   Accelerometer range selection (G_2, G_4, G_8, G_16).
  *
  * @details
  * Updates AFS_SEL bits in ACCEL_CONFIG register. Afterwards, the accel signal path
  * reset is triggered to ensure internal filtering state is refreshed.
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_set_accel_range(MPU_6050_t *handles, MPU_6050_accel_range_t range);

/**
  * @brief  Enable or disable selected sensor data in FIFO buffer.
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  content FIFO content mask (combination of MPU_6050_fifo_content_t values).
  * @param  state   MPU_ENABLE to set bits, MPU_DISABLE to clear bits.
  *
  * @details
  * Modifies FIFO_EN register to select which sensor outputs are written into FIFO.
  * This function only configures FIFO content selection; FIFO must be enabled in
  * USER_CTRL separately.
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_set_fifo_content(MPU_6050_t *handles, MPU_6050_fifo_content_t content, MPU_6050_state_t state);

/**
  * @brief  Start single DMA read of sensor measurement payload.
  * @param  handles Pointer to MPU6050 handle structure.
  *
  * @details
  * Starts a DMA read from ACCEL_XOUT_H for FULL_PAYLOAD_SIZE bytes:
  * accel (6), temperature (2), gyro (6) = 14 bytes total.
  * Completion is reported via I2C/DMA callbacks (HAL layer).
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_single_read(MPU_6050_t *handles);

/**
  * @brief  Extracts current FIFO buffer count.
  * @param  handles Pointer to MPU6050 handle structure.
  *
  * @details
  * Reads FIFO_COUNT_H and FIFO_COUNT_L registers (16-bit) to determine the number of
  * bytes currently stored in the FIFO buffer.
  *
  * @note According to the datasheet, reading FIFO_COUNT_H latches the value of both
  * FIFO count registers. Therefore the count must be read in high-then-low order
  * to obtain a coherent snapshot.
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_read_fifo_cnt(MPU_6050_t *handles);

/**
  * @brief  Start burst DMA read from FIFO.
  * @param  handles Pointer to MPU6050 handle structure.
  *
  * @details
  * Starts a DMA read from FIFO_R_W register for handles->burst_count bytes.
  * FIFO must be properly configured and enabled before calling this function.
  * handles->burst_count must be a multiple of the current payload size in bytes
  * Make sure to provide DMA buffer >= handles->burst_count.
  * 
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_burst_read(MPU_6050_t *handles);

/**
  * @brief  Convert raw 14-byte payload into 16-bit signed values.
  * @param  raw   Pointer to raw sensor payload (14 bytes).
  * @param  inter Pointer to output buffer for converted values (7 x int16_t).
  *
  * @details
  * Output order:
  *  [0..2] accel XYZ, [3] temperature, [4..6] gyro XYZ.
  *
  * @retval None.
  */
void MPU_6050_parse_payload(uint8_t *raw, int16_t *inter);

/**
  * @brief  Convert parsed raw data to scaled physical units.
  * @param  handles Pointer to MPU6050 handle structure.
  * @param  payload Pointer to converted raw measurement array (7 x int16_t).
  *
  * @details
  * Uses currently selected ranges to scale:
  *  - accelerometer to g,
  *  - gyroscope to deg/s,
  * and converts temperature to degrees Celsius.
  *
  * Note: scaling depends on internal range state used by this driver.
  *
  * @retval MPU6050_data_t structure with scaled values.
  */
MPU_6050_data_t MPU_6050_payload_to_readable(MPU_6050_t *handles, const int16_t payload[7]);

/**
  * @brief  Handle interrupts coming from INT pin
  * @param  handles Pointer to MPU6050 handle structure.
  *
  * @details
  * Triggers single read if received DATA_RDY_INT(single read mode)
  * or FIFO reset if received FIFO_OFLOW_INT(burst read)
  * 
  * @note This function should not be called from ISR context
  *
  * @retval HAL status.
  */
HAL_StatusTypeDef MPU_6050_int_isr(MPU_6050_t *handles);

HAL_StatusTypeDef MPU_6050_i2c_rxcplt_isr(MPU_6050_t *handles);

#ifdef __cplusplus
}
#endif

#endif